arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/inc/fsl_ftm_driver.h
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef __FSL_FTM_DRIVER_H__
#define __FSL_FTM_DRIVER_H__


#include <stdint.h>
#include <stdbool.h>
#include "fsl_ftm_hal.h"
/*!
 * @addtogroup ftm_driver FTM Driver
 * @ingroup ftm
 * @brief FlexTimer Peripheral Driver.
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*! @brief Max value for PWM duty cycle */
#define FTM_MAX_DUTY_CYCLE      0x8000U
/*! @brief Shift value which converts duty to ticks */
#define FTM_DUTY_TO_TICKS_SHIFT 15U
/*! @brief Table of base addresses for FTM instances. */
extern FTM_Type * const g_ftmBase[FTM_INSTANCE_COUNT];

/*! @brief Table to save FTM IRQ enumeration numbers defined in the CMSIS header file. */
extern const IRQn_Type g_ftmIrqId[FTM_INSTANCE_COUNT];

/*! @brief FTM status */
typedef enum
{
    FTM_STATUS_SUCCESS  = 0U,   /*!< FTM success status.*/
    FTM_STATUS_ERROR    = 1U,   /*!< FTM error status.*/
} ftm_status_t;

/*! @brief FTM status */
typedef enum
{
    FTM_EDGE_DETECT         = 0U,    /*!< FTM edge detect.*/
    FTM_SIGNAL_MEASUREMENT  = 1U,    /*!< FTM signal measurement.*/
    FTM_NO_OPERATION        = 2U,    /*!< FTM no operation.*/
} ftm_input_op_mode_t;

/*! @brief FlexTimer input capture measurement type for dual edge input capture*/
typedef enum
{
    FTM_NO_MEASUREMENT      = 0x00U,    /*!< No measurement */
    FTM_PERIOD_MEASUREMENT  = 0x01U,    /*!< Period measurement */
    FTM_DUTY_MEASUREMENT    = 0x02U     /*!< Duty measurement */
}ftm_signal_measurement_mode_t;

/*! @brief FlexTimer operation mode */
typedef enum
{
    FTM_MODE_INPUT_CAPTURE      = 0x00U,    /*!< Input capture */
    FTM_MODE_OUTPUT_COMPARE     = 0x01U,    /*!< Output compare */
    FTM_MODE_EDGE_ALIGNED_PWM   = 0x02U,    /*!< Edge aligned PWM */
    FTM_MODE_CEN_ALIGNED_PWM    = 0x03U,    /*!< Centre aligned PWM */
    FTM_DUAL_EDGE_CAPTURE       = 0x04U,    /*!< Dual edge capture */
    FTM_MODE_QUADRATURE_DECODER = 0x05U,    /*!< Quadrature decoder */
    FTM_MODE_UP_TIMER           = 0x06U,    /*!< Timer with up counter */
    FTM_MODE_UP_DOWN_TIMER      = 0x07U     /*!< timer with up-down counter */
}ftm_config_mode_t;

/*!
 * @brief FlexTimer Registers sync parameters
 */
typedef struct _ftm_sync_t
{
    /*!< Please don't use software and hardware trigger simultaneously */
    bool softwareSync;                      /*!< True - enable software sync,
                                                 False - disable software sync */
    bool hardwareSync0;                     /*!< True - enable hardware0 sync,
                                                 False - disable hardware0 sync */
    bool hardwareSync1;                     /*!< True - enable hardware1 sync,
                                                 False - disable hardware1 sync */
    bool hardwareSync2;                     /*!< True - enable hardware2 sync,
                                                 False - disable hardware2 sync */
    bool maxLoadingPoint;                   /*!< True - enable max loading point,
                                                 False - disable max loading point */
    bool minLoadingPoint;                   /*!< True - enable min loading point,
                                                 False - disable min loading point */
    ftm_reg_update_t inverterSync;          /*!< Configures INVCTRL sync */
    ftm_reg_update_t outRegSync;            /*!< Configures SWOCTRL sync */
    ftm_reg_update_t maskRegSync;           /*!< Configures OUTMASK sync */
    ftm_reg_update_t initCounterSync;       /*!< Configures CNTIN sync */
    bool autoClearTrigger;                  /*!< Available only for hardware trigger */
    ftm_pwm_sync_mode_t syncPoint;          /*!< Configure synchronization method
                                                (waiting next loading point or immediate) */
} ftm_pwm_sync_t;

/*! @brief Configuration structure that the user needs to set */

typedef struct FtmUserConfig {
    ftm_pwm_sync_t syncMethod;          /*!< Register synch options available in the
                                            ftm_sync_method_t enumeration  */
    ftm_clock_ps_t ftmPrescaler;        /*!< Register prescaler options available in the
                                            ftm_clock_ps_t enumeration  */
    ftm_clock_source_t ftmClockSource;  /*!< Select clock source for FTM */
    ftm_bdm_mode_t BDMMode;             /*!< Select FTM behaviour in BDM mode */
    uint8_t tofFrequency;               /*!< Select ratio between number of overflows to
                                            times TOF is set */
    bool isWriteProtection;             /*!< true: enable write protection,
                                             false: write protection is disabled  */
    bool isTofIsrEnabled;               /*!< true: enable interrupt,
                                             false: write interrupt is disabled */
} ftm_user_config_t;

/*!
 * @brief FlexTimer driver timer mode config structure
 */
typedef struct _ftm_timer_param_t
{
    ftm_config_mode_t mode;         /*!< FTM mode */
    uint16_t initialValue;          /*!< Initial counter value */
    uint16_t finalValue;            /*!< Final counter value */
}ftm_timer_param_t;


/*!
 * @brief FlexTimer driver PWM Fault channel parameters
 */
typedef struct _ftm_pwm_ch_fault_param_t
{
    bool faultChannelEnabled;       /*!< Fault channel state */
    bool faultFilterEnabled;        /*!< Fault channel filter state */
    bool ftmFaultPinPolarity;       /*!< Channel output state on fault */
}ftm_pwm_ch_fault_param_t;

/*!
 * @brief FlexTimer driver PWM Fault parameter
 */
typedef struct _ftm_pwm_fault_param_t
{
    /*!< Output pin state on fault */
    bool pwmOutputStateOnFault;
    /*!< PWM fault interrupt state */
    bool pwmFaultInterrupt;
    /*!< Fault filter value */
    uint8_t faultFilterValue;
    /*!< Fault mode */
    ftm_fault_mode_t faultMode;
     /*!< Fault channels configuration */
    ftm_pwm_ch_fault_param_t ftmFaultChannelParam[FTM_FEATURE_FAULT_CHANNELS];
}ftm_pwm_fault_param_t;



/*!
 * @brief FlexTimer driver independent PWM parameter
 */
typedef struct _ftm_independent_ch_param_t
{
    uint8_t                 hwChannelId;            /*!< Physical hw channel ID*/
    ftm_polarity_t          polarity;               /*!< PWM output polarity */
    uint32_t                uDutyCyclePercent;      /*!< PWM pulse width, value should be between
                                                         0 (0%) to FTM_MAX_DUTY_CYCLE (100%). */
}ftm_independent_ch_param_t;


/*!
 * @brief FlexTimer driver combined PWM parameter
 */

typedef struct _ftm_pwm_combined_ch_param_t
{   /*!< Physical hw channel ID for channel (n) */
    uint8_t                         hwChannelId;
    /*!< First edge time. This time is relative to signal period. The value for this parameter is
    between 0 and FTM_MAX_DUTY_CYCLE( 0 = 0% from period and FTM_MAX_DUTY_CYCLE = 100% from period) */
    uint32_t                        firstEdge;
    /*!< Second edge time. This time is relative to signal period. The value for this parameter is
    between 0 and FTM_MAX_DUTY_CYCLE( 0 = 0% from period and FTM_MAX_DUTY_CYCLE = 100% from period) */
    uint32_t                        secondEdge;
    /*!< Enable/disable dead time for channel */
    bool                            deadTime;
    /*!< Main channel polarity. For FTM_POLARITY_HIGH first output value is 0 and for
    FTM_POLAIRTY first output value is 1. */
    ftm_polarity_t                  mainChannelPolarity;
    /*!< Select if channel (n+1)  output is enabled/disabled */
    bool                            enableSecondChannelOutput;
    /*!< Select channel (n+1) polarity relative to channel (n) */
    ftm_second_channel_polarity_t   secondChannelPolarity;
}ftm_combined_ch_param_t;
/*!
 * @brief FlexTimer driver PWM parameters
 */
typedef struct _ftm_pwm_param_t
{
    /*!< Number of independent PWM channels */
    uint8_t                      nNumIndependentPwmChannels;
    /*!< Number of combined PWM channels */
    uint8_t                      nNumCombinedPwmChannels;
    /*!< FTM mode */
    ftm_config_mode_t            Mode;
    /*!< Dead time value in [ticks] */
    uint8_t                      deadTimeValue;
    /*!< Dead time prescaler value[ticks] */
    ftm_deadtime_ps_t            deadTimePrescaler;
    /*!< PWM period in Hz */
    uint32_t                     uFrequencyHZ;
    /*!< Configuration for independent PWM channels */
    ftm_independent_ch_param_t   (*pwmIndependentChannelConfig)[];
    /*!< Configuration for combined PWM channels */
    ftm_combined_ch_param_t      (*pwmCombinedChannelConfig)[];
    /*!< Configuration for PWM fault */
    ftm_pwm_fault_param_t        * faultConfig;
}ftm_pwm_param_t;

/*! @brief FlexTimer input capture edge mode, rising edge, or falling edge */
typedef enum
{
    FTM_NO_PIN_CONTROL = 0x00U,     /*!< No trigger */
    FTM_RISING_EDGE = 0x01U,        /*!< Rising edge trigger */
    FTM_FALLING_EDGE = 0x02U,       /*!< Falling edge trigger */
    FTM_BOTH_EDGES = 0x03U,         /*!< Rising and falling edge trigger */
}ftm_edge_alignment_mode_t;

/*!
 * @brief FlexTimer driver Input capture parameters
 */
typedef struct _ftm_input_ch_param_t
{
    uint8_t                         hwChannelId;      /*!< Physical hw channel ID*/
    ftm_input_op_mode_t             InputMode;        /*!< FlexTimer module mode of operation  */
    ftm_edge_alignment_mode_t       EdgeAlignement;   /*!< Edge alignment Mode for signal measurement*/
    ftm_signal_measurement_mode_t   MeasurementType;  /*!< Measurement Mode for signal measurement*/
    uint16_t                        FilterValue;      /*!< Filter Value */
    bool                            FilterEn;         /*!< Input capture filter state */
    bool                            ContinuousModeEn; /*!< Continuous measurement state */
}ftm_input_ch_param_t;

/*!
 * @brief FlexTimer driver input capture parameters
 */
typedef struct _ftm_input_param_t
{
    uint8_t                 nNumChannels;       /*!< Number of input capture channel used */
    uint16_t                nMaxCountValue;     /*!< Max counter value. Min value is 0 for this mode */
    ftm_input_ch_param_t    (*inputChConfig)[]; /*!< Input capture channels configuration */
}ftm_input_param_t;


/*!
 * @brief FlexTimer driver PWM parameters
 */
typedef struct _ftm_output_cmp_ch_param_t
{
    uint8_t                   hwChannelId;      /*!< Physical hw channel ID*/
    ftm_output_compare_mode_t ChMode;           /*!< Channel output mode*/
    uint32_t                  comparedValue;    /*!< The compared value */
}ftm_output_cmp_ch_param_t;


/*!
 * @brief FlexTimer driver PWM parameters
 */
typedef struct _ftm_output_cmp_param_t
{
    uint8_t              nNumOutputChannels;            /*!< Number of output compare channels */
    ftm_config_mode_t    mode;                          /*!< FlexTimer PWM operation mode */
    uint32_t             maxCountValue;                 /*!< Maximum count value in ticks */
    ftm_output_cmp_ch_param_t (*outputChannelConfig)[]; /*!< Output compare channels config */
}ftm_output_cmp_param_t;

/*!
 * @brief FlexTimer qudrature decoder channel parameters
 */
typedef struct FtmPhaseParam
{
    bool kFtmPhaseInputFilter;                      /*!< True: disable phase filter,
                                                         False: enable phase filter */
    uint32_t kFtmPhaseFilterVal;                    /*!< Filter value (if input filter is enabled )*/
    ftm_quad_phase_polarity_t kFtmPhasePolarity;    /*!< Phase polarity */
}ftm_phase_params_t;


