arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/inc/fsl_ftm_driver.h
/*! @brief FTM quadrature config structure */
typedef struct ftm_quad_decode_config_t
{
    ftm_quad_decode_mode_t mode;        /*!< FTM_QUAD_PHASE_ENCODE or FTM_QUAD_COUNT_AND_DIR */
    uint16_t initial_val;               /*!< Initial counter value*/
    uint16_t max_val;                   /*!< Max counter value*/
    ftm_phase_params_t phase_a_config;  /*!< Configuration for the input phase a*/
    ftm_phase_params_t phase_b_config;  /*!< Configuration for the input phase b*/
} ftm_quad_decode_config_t;

/*! @brief FTM quadrature state(counter value and flags) */
typedef struct ftm_quad_decoder_state_t
{
    uint16_t counter;           /*!< Counter value */
    bool overflow_flag;         /*!< True if overflow occurred,
                                     False if overflow doesn't occurred*/
    bool overflow_direction;    /*!< False if overflow occurred at minimum value,
                                     True if overflow occurred at maximum value*/
} ftm_quad_decoder_state_t;


/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Initializes the FTM driver.
 *
 * @param instance The FTM peripheral instance number.
 * @param info The FTM user configuration structure, see #ftm_user_config_t.
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_Init(uint8_t instance, const ftm_user_config_t *info);

/*!
 * @brief Shuts down the FTM driver.
 *
 * @param instance The FTM peripheral instance number.
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_Deinit(uint8_t instance);

/*!
 * @brief Starts the FTM counter.
 *
 * Starts the FTM counter. This function provides access to the
 * FTM counter settings. The counter can be run in Up counting and Up-down counting modes.
 * To run the counter in Free running mode, choose Up counting option and provide
 * 0x0 for the countStartVal and 0xFFFF for countFinalVal. Please call this
 * function only when FTM is used as timer/counter.
 *
 * @param instance The FTM peripheral instance number.
 * @param timer Timer configuration structure.
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_CounterStart(uint8_t instance, ftm_timer_param_t timer);
/*!
 * @brief Stops the FTM counter.
 *
 * @param instance The FTM peripheral instance number.
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_CounterStop(uint8_t instance);

/*!
 * @brief Reads back the current value of the FTM counter.
 *
 * @param instance The FTM peripheral instance number.
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
uint32_t FTM_DRV_CounterRead(uint8_t instance);

/*!
 * @brief Stops all PWM channels .
 *
 * @param instance The FTM peripheral instance number.
 * @return counter the current counter value
 */
ftm_status_t FTM_DRV_DeinitPwm(uint8_t instance);

/*!
 * @brief Configures the duty cycle and frequency and starts outputting the PWM on
 * all channels configured in param.
 *
 * @param instance The FTM peripheral instance number.
 * @param param FTM driver PWM parameter to configure PWM options
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_InitPwm(uint8_t instance, const ftm_pwm_param_t *  param);

/*!
 * @brief This function updates the waveform output in PWM mode (duty cycle and phase).
 *
 * @param instance The FTM peripheral instance number.
 * @param channel The channel number. In combined mode, the code  finds the channel
 * @param firstEdge  Duty cycle or first edge time for combined mode. Can take value between
 *                   0 - FTM_MAX_DUTY_CYCLE(0 = 0% from period  and FTM_MAX_DUTY_CYCLE = 100% from period)
 * @param secondEdge Second edge time - only for combined mode. Can take value
 *                   between 0 - FTM_MAX_DUTY_CYCLE(0 = 0% from period  and FTM_MAX_DUTY_CYCLE = 100% from period).
 * @param softwareTrigger - if true a software trigger is generate to update PWM parameters
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_UpdatePwmChannel(uint8_t instance, uint8_t channel, uint16_t firstEdge,
                                        uint16_t secondEdge, bool softwareTrigger);
/*!
 * @brief This function configures sync mechanism for some FTM registers ( MOD, CNINT, HCR,
 *          CnV, OUTMASK, INVCTRL, SWOCTRL).
 *
 * @param instance The FTM peripheral instance number.
 * @param param The sync configuration structure.
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_SetSync(uint8_t instance, ftm_pwm_sync_t param);

/*!
 * @brief Configures the FTM to generate timed pulses(Output compare mode).
 *
 * When the FTM counter matches the value of CnV, the channel output is changed based on what is
 * specified in the compareMode argument. The signal period can be modified using
 * param->MaxCountValue. After this function max counter value and CnV are equal.
 * FTM_DRV_SetNextComparematchValue function ca be used to change CnV value.
 *
 * @param instance    The FTM peripheral instance number.
 * @param param configuration of the output compare channels
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_InitOutputCompare(uint8_t instance, const ftm_output_cmp_param_t *param);

/*!
 * @brief  Disables compare match output control and clears FTM timer configuration
 *
 * @param instance    The FTM peripheral instance number.
 * @param param configuration of the output compare channel
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_DeinitOutputCompare(uint8_t instance, const ftm_output_cmp_param_t *param);

/*!
 * @brief Sets the next compare match value based on the current counter value
 *
 * @param instance    The FTM peripheral instance number.
 * @param channel configuration of the output compare channel
 * @param NextComparematchValue timer value in ticks until the next compare match event should appear
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_UpdateOutputCompareChannel(uint8_t instance, uint8_t channel,
                                                uint16_t NextComparematchValue, bool softwareTrigger);

/*!
 * @brief   Configures Channel Input Capture for either getting time-stamps on edge detection
 * or on signal measurement . When the edge specified in the captureMode
 * argument occurs on the channel the FTM counter is captured into the CnV register.
 * The user will have to read the CnV register separately to get this value. The filter
 * function is disabled if the filterVal argument passed in is 0. The filter function
 * is available only on channels 0,1,2,3.
 *
 * @param instance    The FTM peripheral instance number
 * @param param configuration of the input capture channel
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_InitInputCapture(uint8_t instance, const ftm_input_param_t * param);
/*!
 * @brief  Disables input capture mode and clears FTM timer configuration
 *
 * @param instance    The FTM peripheral instance number.
 * @param param configuration of the output compare channel
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_DeinitInputCapture(uint8_t instance, const ftm_input_param_t * param);
/*!
 * @brief  This function is used to calculate the measurement and/or time stamps values
 * which are read from the C(n, n+1)V registers and stored to the static buffers.
 *
 * @param instance    The FTM peripheral instance number
 * @param channel     FTM Hw channel or pair Id
 * @return value   the value measured
 */
uint16_t FTM_DRV_GetInputCaptureMeasurement(uint8_t instance, uint8_t channel);

/*!
 * @brief  Starts new single-shot signal measurement of the given channel.
 *
 * @param instance    The FTM peripheral instance number.
 * @param channel configuration of the output compare channel
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_StartNewSignalMeasurement(uint8_t instance, uint8_t channel);
/*!
 * @brief Configures the quadrature mode and starts measurement
 *
 * @param instance     Instance number of the FTM module.
 * @param config       Config structure( quadrature decode mode, polarity for both phases,
 *                      initial and max value for the counter, filter config)
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_QuadDecodeStart(uint8_t instance, ftm_quad_decode_config_t config);

/*!
 * @brief De-activates the quadrature decode mode.
 *
 * @param instance  Instance number of the FTM module.
 * @return success
 *        - FTM_STATUS_SUCCESS : Completed successfully.
 *        - FTM_STATUS_ERROR : Error occurred.
 */
ftm_status_t FTM_DRV_QuadDecodeStop(uint8_t instance);

/*!
 * @brief Return the current quadrature decoder state (counter value, overflow flag and
 * overflow direction)
 *
 * @param instance  Instance number of the FTM module.
 * @return The current state of quadrature decoder
 */
ftm_quad_decoder_state_t FTM_DRV_QuadGetState(uint8_t instance);

/*!
 * @brief Retrieves the frequency of the clock source feeding the FTM counter.
 *
 * Function will return a 0 if no clock source is selected and the FTM counter is disabled
 *
 * @param instance The FTM peripheral instance number.
 * @return The frequency of the clock source running the FTM counter (0 if counter is disabled)
 */
uint32_t FTM_DRV_GetFrequency(uint8_t instance);


/*!
 * @brief This function is used to covert the given frequency to period in ticks
 *
 * @param instance The FTM peripheral instance number
 * @param freqencyHz  frequency value in Hz
 *
 * @return uint16_t
 */
uint16_t FTM_DRV_ConvertFreqToPeriodTicks(uint8_t instance,  uint32_t freqencyHz);

#if defined(__cplusplus)
}
#endif

/*! @}*/


#endif /* __FSL_FTM_DRIVER_H__*/
/*******************************************************************************
 * EOF
 ******************************************************************************/

/*! @}*/ /* End of addtogroup ftm_driver */
